# GetPresentationLayerAssignments Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..GetPresentationLayerAssignments Method
ExporterIFC Class See Also
---
Get the list of the internally IfcPresentationLayerAssignments and their respective shape representations.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public IDictionary<string, IList<IFCAnyHandle>> GetPresentationLayerAssignments()
```

Visual Basic
---
```text
Public Function GetPresentationLayerAssignments As IDictionary(Of String, IList(Of IFCAnyHandle))
```

Visual C++
---
```text
public:
IDictionary<String^, IList<IFCAnyHandle^>^>^ GetPresentationLayerAssignments()
```

# ### Return Value
The map.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace